# for my-en
header1 = [
    "စဉ်",
    "မြန်မာဗျည်း",
    "အသံထွက်သင်္ကေတ (မြန်-လိပ် ၂၀၁၉)",
    "အင်္ဂလိပ်အက္ခရာ ဖလှယ်နည်းစနစ် (NAIIP)",
    "သာဓက",
    "အင်္ဂလိပ်အက္ခရာ ဖလှယ်ပုံ"
];

data1 = [
    ["၁", "က", "/k/", "ka", "ကရား", "Ka Yarr"],
    ["၂", "ခ", "/kh/", "kha", "ခရေ", "Kha Yay"],
    ["၃", "ဂ/ ဃ", "/g/", "ga/ gga", "ဂမုန်းပွင့်", "Ga Mone Pwint"],
    ["၄", "င", "/ng/", "nga", "ငပလီ", "Nga Pa Le"],
    ["၅", "စ", "/s/", "sa", "စမုန်မြစ်", "Sa Moun Myit"],
    ["၆", "ဆ", "/hs/", "hsa", "ဆလတ်ရွက်", "Hsa Lat Ywet"],
    ["၇", "ဇ/ ဈ", "/z/", "za/ zza", "ဇလပ်ဝါ", "Za Lap War"],
    ["၈", "ည/ ဉ", "/nj/", "nya", "ဉာဏ်မှူး/ မိုးည", "Nyan Hmue/ Moe Nya"],
    ["၉", "ဋ/ တ", "/t/", "tta/ ta", "တမာပင်", "Ta Mar Pin"],
    ["၁၀", "ဌ/ ထ", "/ht/", "htta/ hta", "ထမနဲ", "Hta Ma Nell"],
    ["၁၁", "ဍ၊ဎ၊ဓ/ ဒ", "/d/", "dda/ da", "ဒလ", "Dala"],
    ["၁၂", "ဏ/ န", "/n/", "nma/ na", "နယုန်လ", "Nayoun La"],
    ["၁၃", "ပ", "/p/", "pa", "ပပဝတီ", "Papawate"],
    ["၁၄", "ဖ", "/hp/", "pha", "ဖရုံသီး", "Pha Roum Thee"],
    ["၁၅", "ဗ/ ဘ", "/b/", "bba/ ba", "ဘစိုင်းဝဏ္ဏ", "Ba Sai Wunna"],
    ["၁၆", "မ", "/m/", "ma", "မခင်ငွေ", "Ma Khin Ngway"],
    ["၁၇", "ယ", "/y/", "ya", "ယမုန်နာ", "Ya Moun Nar"],
    ["၁၈", "ရ", "/r/", "ra", "ရန်အောင်/ သူရ", "Ran Aung/ Thuura"],
    ["၁၉", "လ/ ဠ", "/l/", "la/ lla", "လမင်းအောင်", "La Minn Aung"],
    ["၂၀", "ဝ", "/w/", "wa", "ဝဥ", "Wa Ou"],
    ["၂၁", "သ", "/th/", "tha", "သမင်", "Tha Min"],
    ["၂၂", "ဟ", "/h/", "ha", "ဟဟာဟ", "Ha Har Ha"],
    ["၂၃", "ကျ/ ကြ", "/kj/", "kya", "ကျပင်းဆရာဖီး", "Kya Pinn Hsayar Phee"],
    ["၂၄", "ချ/ ခြ", "/ch/", "cha", "ချရားပင်", "Cha Rarr Pin"],
    ["၂၅", "ဂျ/ ဂြ", "/gj/", "gya", "ဂျလေဘီမုန့်", "Gya Lay Be Mont"],
    ["၂၆", "ငှ", "/hng/", "hnga", "ငှက်ဖျား", "Hnget Phyarr"],
    ["၂၇", "ညှ", "/hnj/", "hnya", "ကြံညှပ်", "Kyam Hnyap"],
    ["၂၈", "နှ", "/hn/", "hna", "နှမ", "Hna Ma"],
    ["၂၉", "မှ", "/hm/", "hma", "မှာတမ်းလွှာ", "Hmar Tamm Hlwar"],
    ["၃၀", "ရှ", "/sh/", "sha", "ရှောက်ရွှာမိုး/ လျှောက်လွှာ", "Shauk Shwar Moe/ Shauk Hlwar"],
    ["၃၁", "လှ", "/hl/", "hla", "လှဝင်းမောင်", "Hla Winn Maung"],
    ["၃၂", "ဝှ", "/hw/", "hwa", "လျှို့ဝှက်စာ", "Hlyoh Hwet Sar"],
    ["၃၃", "သှ", "/dh/", "tha", "သတင်းစာ", "Tha Tinn Sar"]
];

header2 = [
    "စဉ်",
    "မြန်မာဗျည်းတွဲ",
    "အသံထွက်သင်္ကေတ (မြန်-လိပ် ၂၀၁၉)",
    "အင်္ဂလိပ်အက္ခရာ ဖလှယ်နည်းစနစ် (NAIIP)",
    "သာဓက",
    "အင်္ဂလိပ်အက္ခရာ ဖလှယ်ပုံ"
]

data2 = [
    ["၁", "ျ", "/j/", "y", "ယပင့်", "Ya Pint"],
    ["၂", "ြ", "/j/", "y", "ယယစ်", "Ya Yit"],
    ["၃", "ွ", "/w/", "w", "ဝဆွဲ", "Wa Hswell"]
]

header3 = [
    "စဉ်",
    "မြန်မာသရ",
    "အသံထွက်သင်္ကေတ (မြန်-လိပ် ၂၀၁၉)",
    "အင်္ဂလိပ်အက္ခရာ ဖလှယ်နည်းစနစ် (NAIIP)",
    "သာဓက",
    "အင်္ဂလိပ်အက္ခရာ ဖလှယ်ပုံ"
]

data3 = [
    ["၁", "အ", "/a/", "a", "အချစ်", "Achit"],
    ["၂", "အာ", "/a/", "ar", "အာကာမျိုး", "Arkar Myoe"],
    ["၃", "အ", "/a./", "ah", "မောင်အ", "Mg Ah"],
    ["၄", "အား", "/a:/", "arr", "ဦးဖိုးကျား", "U Phoe Kyarr"],
    ["၅", "အီ/ ဤ/ အည်", "/i/", "e/ i", "ရီရီမြင့်/ စည်သူဝင်း", "Re Re Myint/ Sithuu Winn"],
    ["၆", "အိ/ ဣ/ ၏/ အည့်", "/i./", "ei/ eii", "အိအိချွန်/ ဖူးပြည့်ခိုင်/ အိနန္ဒာကျော့",
        "Ei Ei Chun/ Phoo Pyei Khaing/ Ei Nandar Kyawt"
    ],
    ["၇", "အီး/ အည်း", "/i:/", "ee/ ii", "နတ်သမီး", "Nat Tha Mee"],
    ["၈", "အူ/ ဦ", "/u/", "uu/ oou", "သူဇာ/ မူမူခိုင်", "Thuuzar/ Muu Muu Khaing"],
    ["၉", "အု/ ဥ", "/u./", "ou/ u", "ရွှေဥ/ ယုယု", "Shway Ou/ Yu Yu"],
    ["၁၀", "အူး/ ဦး", "/u:/", "oo/ U/ ue", "ဦးမြဦး/ ဖူးဖူး/ မှူးမှူး", "U Mya Oo/ Phoo Phoo/ Hmue Hmue"],
    ["၁၁", "အေ/ ဧ", "/ei/", "ay/ ayy", "ဖေမြင့်", "Phay Myint"],
    ["၁၂", "အေ့", "/ei./", "ae", "ချမ်းမြေ့မောင်ချို", "Chamm Myae Maung Cho"],
    ["၁၃", "အေး", "/ei:/", "aye", "ဒေါ်အေးအေးမြင့်", "Daw Aye Aye Myint"],
    ["၁၄", "အယ်", "/e/", "el", "မိုးမြင့်ကြယ်", "Moe Myint Kyel"],
    ["၁၅", "အဲ့/ အယ့်", "/e./", "elt/ ellt", "လဲ့လဲ့ဝင်း", "Lelt Lelt Winn"],
    ["၁၆", "အဲ", "/e:/", "ell", "စောခူဆဲ", "Saww Khuu Hsell"],
    ["၁၇", "အော်/ ‌ဪ", "/o/", "aw/ aaw", "ဦးပေါ်ဦး/ ကျော်ကျော်", "U Paw Oo/ Kyaw Kyaw"],
    ["၁၈", "အော့", "/o./", "awt", "ပန်းတမော့/ အိကျော့", "Pann Ta Mawt/ Ei Kyawt"],
    ["၁၉", "အော/ ဩ", "/o:/", "aww/ aaww", "စောတောနော်", "Saww Taww Naw"],
    ["၂၀", "အို", "/ou/", "o", "ကိုပြည်", "Ko Pyi"],
    ["၂၁", "အို့", "/ou./", "oh", "မို့မို့ဇော်ဝင်း", "Moh Moh Zaw Winn"],
    ["၂၂", "အိုး", "/ou:/", "oe", "မောင်သာနိုး/ ပြအိုး", "Mg Thar Noe/ Pya Oe"],
    ["၂၃", "အက်", "/e'/", "et", "ခင်ခက်ခက်ခိုင်", "Khin Khet Khet Khaing"],
    ["၂၄", "အောက်", "/au'/", "auk", "မောင်ပေါက်စီ", "Mg Pauk Se"],
    ["၂၅", "အိုက်", "/ai'/", "aik", "ဦးတိုက်စံ", "U Taik Sam"],
    ["၂၆", "အင်/ အဉ်", "/in/", "in/ iin", "ထူးအိမ်သင်", "Htoo Eim Thin"],
    ["၂၇", "အင့်/ အဉ့်", "/in./", "int/ iint", "မြင့်သူ", "Myint Thuu"],
    ["၂၈", "အင်း / အဉ်း", "/in:/", "inn/ iinn", "ခင်ဇော်ဝင်း", "Khin Zaw Winn"],
    ["၂၉", "အောင်", "/aun/", "aung/ -g", "မောင်မောင်မောင်အောင်", "Mg Maung Maung Aung"],
    ["၃၀", "အောင့်", "/aun./", "ount", "မြို့ထောင့်စေတီ", "Myoh Htount Say Te"],
    ["၃၁", "အောင်း", "/aun:/", "oung", "အောင်မောင်း", "Aung Moung"],
    ["၃၂", "အိုင်", "/ain/", "aing", "ဇော်ပိုင်", "Zaw Paing"],
    ["၃၃", "အိုင့်", "/ain./", "aint", "တစ်လုံးချိုင့်", "Tit Lome Chaint"],
    ["၃၄", "အိုင်း", "/ain:/", "ai/ ine/ inme", "စိုင်းစိုင်း/ ရှိုင်းဝေအောင်", "Sai Sai/ Shine Way Aung"],
    ["၃၅", "အစ်", "/I'/", "it", "ကစ်ကစ်", "Kit Kit"],
    ["၃၆", "အတ်/ အပ်", "/a'/", "at/ ap/ -ao", "မြတ်ကျော်/ ဇလပ်ဖြူ/ စဝ်ခွန်မိန်း",
        "Myat Kyaw/ Za Lap Phyuu/ Sao Khun Meinn"
    ],
    ["၃၇", "အိတ်/ အိပ်", "/ei'/", "eik/ ake", "သိဒ္ဓိစိုး/ ဆိပ်ခွန်", "Theikdei Soe/ Hsake Khun"],
    ["၃၈", "အုတ်/ အုပ်", "/ou'/", "oat/ oak/ oke", "ဦးဗုဒ်/ အုပ်စိုးခန့်", "U Boak/ Oke Soe Khant"],
    ["၃၉", "အန်/ အမ်/ အံ ", "/an/", "an/ am/ anm", "ရန်နိုင်/ ဦးယံ", "Ran Naing/ U Yam"],
    ["၄၀", "အန့်/ အမ့်/ အံ့", "/an./", "ant/ amt/ anmt", "ခန့်စည်သူ/ အံ့မျိုးထွဋ်", "Khant Sithuu/ Amt Myoe Htutt"],
    ["၄၁", "အန်း/ အမ်း", "/an:/", "ann/ amm/ anmm", "အောင်ဆန်း/ စမ်းစမ်း", "Aung Hsann/ Samm Samm"],
    ["၄၂", "အိန်/ အိမ်", "/ein/", "ein/ eim/ einm", "စိန်စိန်/ ထူးအိမ်သင်", "Sein Sein/ Htoo Eim Thin"],
    ["၄၃", "အိန့်/ အိမ့်", "/ein./", "eint/ eimt/ einmt", "အိမ့်နေခြည်/ မောင်စိမ့်", "Eimt Nay Chi/ Mg Seimt"],
    ["၄၄", "အိန်း/ အိမ်း", "/ein:/", "einn/ eimm/ einmm", "သိန်းသန်းစိုး/ စိမ်းစိမ်းဦး",
        "Theinn Thann Soe/ Seimm Seimm Oo"
    ],
    ["၄၅", "အုန်/ အုမ်/ အုံ", "/oun/", "ohn/ ohm/ oun/ oum/ ohnm", "ပြည်စုန်မင်း/ ဥမ္မာခင်/ ခုံတော်",
        "Pyi Soun Minn/ Ohmmar Khin/ Khoum Taw"
    ],
    ["၄၆", "အုန့်/ အုမ့်/ အုံ့ ", "/oun./", "ont/ omt/ onmt", "ပုံ့ပုံ့", "Pomt Pomt"],
    ["၄၇", "အုန်း/ အုမ်း/ အုံး", "/oun:/", "own/ owm/ one/ ome/ ownm", "ဦးအုန်းမောင်/ မောင်ဖုန်းနိုင်",
        "U Own Maung/ Mg Phone Naing"
    ],
    ["၄၈", "အွတ်/ အွပ်", "/u'/", "ut/ utt", "ဇော်ဝင်းထွဋ်", "Zaw Winn Htutt"],
    ["၄၉", "အွန်", "/un/", "un/ um/ on/ unm", "ခွန်အောင်နိုင်/မွန်", "Khun Aung Naing/ Mon"],
    ["၅၀", "အွန့်", "/un./", "unt/ umt/ unmt", "မျိုးညွန့်", "Myoe Nyunt"],
    ["၅၁", "အွန်း", "/un:/", "unn/ umm/ unnm", "ခွန်းဆင့်နေခြည်", "Khunn Hsint Nay Chi"]
]

content_list_1 = [
    "အသံတူဗျည်းတစ်လုံးစီယူသည့် စနစ်အရ မြန်မာဗျည်းသံ ၃၃ သံ ရှိပါသည်။",
    "\"ကျ၊ ချ၊ ဂျ၊ ငှ၊ ညှ၊ နှ၊ မှ၊ ရှ၊ လှ၊ ဝှ၊ သှ\" တို့သည် သီးခြားဗျည်းသံများဖြစ်သည့်အတွက် သီးခြား ဗျည်းများအဖြစ် သတ်မှတ်ပါသည်။",
    "\"သှ\" မှာ သံပြင်း သ သံကို ညွှန်းခြင်းဖြစ်ပြီး သ အက္ခရာအောက်က အကောက်ကလေး ထည့်ရေးသားခြင်း ဖြစ်ပါသည်။ သှ ကိုလည်း tha ဟု စာလုံးပေါင်းပါသည်။",
]
content_list_2 = [
    "အသံထွက်စနစ်အရ ယပင့် (ျ)၊ ရရစ် (ြ)၊ ဝဆွဲ (ွ) တို့ကို ဗျည်းတွဲအဖြစ် သတ်မှတ်ပါသည်။",
    "ဟထိုး (ှ) တစ်သားတည်းဖြစ်နေသည့် \"ငှ၊ ညှ၊ နှ၊ မှ၊ ရှ၊ လှ၊ ဝှ\" တို့သည် သီးခြားဗျည်းများဖြစ်၍ ဟထိုး (ှ)ကို ဗျည်းတွဲအဖြစ် မသတ်မှတ်ပါ။"
]

content_list_3 = [
    "အသံတူသရတစ်လုံးစီယူသည့် စနစ်အရ မြန်မာသရသံ ၅၁ သံ ရှိပါသည်။",
    "အသံထွက်စနစ်အရ အတ်နှင့် အွတ်၊ အန် နှင့် အွန် တို့သည် သီးခြားသရသံများ ဖြစ်ပါသည်။",
    "အမျိုးသားနာမည် အစ စကားလုံး ဦး ကို U၊ မောင် ကို Mg ဟု စာလုံးပေါင်းပါသည်။",
    "အများသိ မြို့အမည် ၅၃၀ ကို မူလစာလုံးပေါင်းအတိုင်း ဖော်ပြထားပါသည်။",
    "နာမည်တွင် ပါဠိစကားလုံးပါဝင်ပါက ပါဠိစကားလုံးများကို တစ်ဆက်တည်း စာလုံးပေါင်းပါသည်။",
    "ပါဠိစစ်စစ် စာလုံးပေါင်းကို အသုံးပြုလိုပါက ပါဠိ-ရိုမန်ကဏ္ဍတွင် ရှာဖွေရန်ဖြစ်ပါသည်။",
    "ကျမ်းကိုး- နှုတ်ပြောမြန်မာသဒ္ဒါ [မောင်ခင်မင် (ဓနုဖြူ)]၊ မြန်မာသဒ္ဒါ (မြန်မာစာအဖွဲ့)၊ မြန်မာ-အင်္ဂလိပ်အဘိဓာန် (၂၀၁၉)၊ Let's Write English Sentences (စိုးသစ်)၊ The Pali Alphabet in Myanmar and Roman Characters (ပဋ္ဌာနပါဠိ- ပဋ္ဌမတွဲ)။"
]

parli_data1 = [
    ["အ a", "အာ ā", "ဣ i", "ဤ ī", "ဥ u", "ဦ ū", "ဧ e", "ဩ o"],
]

parli_data2 = [
    ["က ka", "ခ kha", "ဂ ga", "ဃ gha", "င ṅa"],
    ["စ ca", "ဆ cha", "ဇ ja", "ဈ jha", "ဉ ña"],
    ["ဋ ṭa", "ဌ ṭha", "ဍ ḍa", "ဓ ḍha", "ဏ ṇa"],
    ["တ ta", "ထ tha", "ဒ da", "ဓ dha", "န na"],
    ["ပ pa", "ဖ pha", "ဗ ba", "ဘ bha", "မ ma"],
]

parli_data3 = [
    ["ယ ya", "ရ ra", "လ la", "ဝ va", "သ sa", "ဟ ha", "ဠ ḷa", "အံ ṃ"],
]

parli_data4 = [
    ["က ka", "ကာ kā", "ကိ ki", "ကီ kī", "ကု ku", "ကူ kū", "ကေ ke", "ကော ko"],
    ["ခ kha", "ခါ khā", "ခိ khi", "ခီ khī", "ခု khu", "ခူ khū", "ခေ khe", "ခေါ kho"],
]

parli_data5 = [
    ["က္က kka", "ဉ္စ ñca", "ဒွ dva", "မ္ဗ mba"],
    ["က္ခ kkha", "ဉ္ဆ ñcha", "ဓျ dhya", "မ္ဘ mbha"],
    ["ကျ kya", "ဉ္ဇ ñja", "ဓွ dhva", "မ္မ mma"],
    ["ကြိ kri", "ဉ္ဈ ñjha", "န္တ nta", "မျ mya"],
    ["က္လ kla", "ဋ္ဋ ṭṭa", "န္တွ ntva", "မှ mha"],
    ["ကွ kva", "ဋ္ဌ ṭṭha", "န္ထ ntha", "ယျ yya"],
    ["ချ khya", "ဍ္ဍ ḍḍa", "န္ဒ nda", "ယှ yha"],
    ["ခွ khva", "ဍ္ဎ ḍḍh", "န္ဒြ ndra", "လ္လ lla"],
    ["ဂ္ဂ gga", "ဏ္ဋ ṇṭa", "န္ဓ ndha", "လျ lya"],
    ["ဂ္ဂ ggha", "ဏ္ဌ ṇṭha", "န္န nna", "လှ lha"],
    ["ဂျ gya", "ဏ္ဍ ṇḍa", "နျ nya", "ဝှ vha"],
    ["ဂြ gra", "ဏ္ဏ ṇṇa", "နှ nha", "သ္ထ sta"],
    ["င်္က ṅka", "ဏှ ṇha", "ပ္ပ ppa", "သ္တြ stra"],
    ["င်္ခ ṅkha", "ထ္ထ ttha", "ပ္ဖ ppha", "သ္န sna"],
    ["င်္ဂ ṅga", "တွ tva", "ဗ္ဗ bba", "သျ sya"],
    ["င်္ဃ ṅgha", "တျ tya", "ဗ္ဘ bbha", "ဿ ssa"],
    ["စ္စ cca", "ဒ္ဒ dda", "ဗျ bya", "ဟ္မ hma"],
    ["စ္ဆ ccha", "ဒ္ဓ ddha", "ဗြ bra", "ဟွ hva"],
    ["ဇ္ဇ jja", "ဒျ dya", "မ္ပ mpa", "ဠ ḷha"],
    ["ဇ္ဈ jjha", "ဒြ dra", "မ္ဖ mpha", ""]
]

parli_data6 = [
    ["ာ-ါ- ā", "ိ- i;", "ီ– ī;", "ု- u;", "ူ- u", "‌ေ- e", "ော-‌ေါ- o"]
]

parli_data7 = [
    ["၁", "၂", "၃", "၄", "၅", "၆", "၇", "၈", "၉", "၀"],
    ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0"]
]