singleton = {
    "က": {"mm": "k", "ipa": "k"},
    "ခ": {"mm": "kh", "ipa": "kʰ"},
    "ဂ": {"mm": "ɡ", "ipa": "ɡ"},
    "ဃ": {"mm": "ɡ", "ipa": "ɡ"},
    "င": {"mm": "n", "ipa": "ŋ"},
    "စ": {"mm": "s", "ipa": "s"},
    "ဆ": {"mm": "hs", "ipa": "sʰ"},
    "ဇ": {"mm": "z", "ipa": "z"},
    "ဈ": {"mm": "z", "ipa": "z"},
    "ဉ": {"mm": "nj", "ipa": "ɲ"},
    "ည": {"mm": "nj", "ipa": "ɲ"},
    "ဋ": {"mm": "t", "ipa": "t"},
    "ဌ": {"mm": "ht", "ipa": "tʰ"},
    "ဍ": {"mm": "d", "ipa": "d"},
    "ဎ": {"mm": "d", "ipa": "d"},
    "ဏ": {"mm": "n", "ipa": "n"},
    "တ": {"mm": "t", "ipa": "t"},
    "ထ": {"mm": "ht", "ipa": "tʰ"},
    "ဒ": {"mm": "d", "ipa": "d"},
    "ဓ": {"mm": "d", "ipa": "d"},
    "န": {"mm": "n", "ipa": "n"},
    "ပ": {"mm": "p", "ipa": "p"},
    "ဖ": {"mm": "hp", "ipa": "pʰ"},
    "ဗ": {"mm": "b", "ipa": "b"},
    "ဘ": {"mm": "b", "ipa": "b"},
    "မ": {"mm": "m", "ipa": "m"},
    "ယ": {"mm": "j", "ipa": "j"},
    "ရ": {"mm": "r", "ipa": "r"},
    "လ": {"mm": "l", "ipa": "l"},
    "ဝ": {"mm": "w", "ipa": "w"},
    "သ": {"mm": "th", "ipa": "θ"},
    "ဟ": {"mm": "h", "ipa": "h"},
    "ဠ": {"mm": "l", "ipa": "l"},
    "အ": {"mm": "", "ipa": ""},
}

vowelForm = {
    "ာ": {"mm": "a", "ipa": "a"},
    "ါ": {"mm": "a", "ipa": "a"},
    "ိ": {"mm": "i.", "ipa": "i."},
    "ီ": {"mm": "i", "ipa": "i"},
    "ု": {"mm": "u.", "ipa": "u."},
    "ူ": {"mm": "u", "ipa": "u"},
    "ေ": {"mm": "ei", "ipa": "e"},
    "ံ": {"mm": "an", "ipa": "ã"},
    "ဲ": {"mm": "eː", "ipa": "ɛː"},
    "ှ": {"mm": "h", "ipa": "h"},
}

specialCharsForm = {
    "၁": {"mm": "1", "ipa": "1"},
    "၂": {"mm": "2", "ipa": "2"},
    "၃": {"mm": "3", "ipa": "3"},
    "၄": {"mm": "4", "ipa": "4"},
    "၅": {"mm": "5", "ipa": "5"},
    "၆": {"mm": "6", "ipa": "6"},
    "၇": {"mm": "7", "ipa": "7"},
    "၈": {"mm": "8", "ipa": "8"},
    "၉": {"mm": "9", "ipa": "9"},
    "၀": {"mm": "0", "ipa": "0"},
    "၊": {"mm": ",", "ipa": ","},
    "။": {"mm": ".", "ipa": "."},
}

asatExtendedForm = {
    
            "\u103e\u1031\u102c\u1000\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ငှောက် auʼ, auʔ
            "\u103e\u1031\u102c\u1002\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဂ် auʼ, auʔ
            "\u103e\u1031\u102c\u1004\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောင်း aunː, aũː
            "\u103e\u1031\u102c\u1004\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောင့် aun., aũ.
            "\u103e\u1031\u102c\u1004\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောင် aun, aũ
            "\u103e\u1031\u102c\u1005\u103a": {
            "mm": "o\u02d0s",
            "ipa": "\u0254\u02d0s"
            }, # ကောစ် oːs, ɔːs
            "\u103e\u1031\u102c\u1007\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဇ်, auʼ, auʔ
            "\u103e\u1031\u102c\u1009\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောဉ်း aunː, aũː
            "\u103e\u1031\u102c\u1009\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောဉ့် aun., aũ.
            "\u103e\u1031\u102c\u1009\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောဉ် aun, aũ
            "\u103e\u1031\u102c\u100a\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောည်း aunː, aũː
            "\u103e\u1031\u102c\u100a\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောည့် aun., aũ.
            "\u103e\u1031\u102c\u100a\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောည် aun, aũ
            "\u103e\u1031\u102c\u100b\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဋ် auʼ, auʔ
            "\u103e\u1031\u102c\u100d\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဍ် auʼ, auʔ
            "\u103e\u1031\u102c\u100f\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောဏ်း aunː, aũː
            "\u103e\u1031\u102c\u100f\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောဏ့် aun., aũ.
            "\u103e\u1031\u102c\u100f\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောဏ် aun, aũ
            "\u103e\u1031\u102c\u1010\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောတ် auʼ, auʔ
            "\u103e\u1031\u102c\u1012\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဒ် auʼ, auʔ
            "\u103e\u1031\u102c\u1014\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောန်း aunː, aũː
            "\u103e\u1031\u102c\u1014\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောန့် aun., aũ.
            "\u103e\u1031\u102c\u1014\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောန် aun, aũ
            "\u103e\u1031\u102c\u1015\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောပ် auʼ, auʔ
            "\u103e\u1031\u102c\u1017\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဗ် auʼ, auʔ
            "\u103e\u1031\u102c\u1019\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောမ်း aunː, aũː
            "\u103e\u1031\u102c\u1019\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောမ့် aun., aũ.
            "\u103e\u1031\u102c\u1019\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောမ် aun, aũ
            "\u103e\u1031\u102c\u101a\u1037\u103a": {
            "mm": "o.",
            "ipa": "\u0254."
            }, # ကောယ့် o., ɔ.
            "\u103e\u1031\u102c\u101a\u103a": {
            "mm": "o",
            "ipa": "\u0254"
            }, # ကောယ် o, ɔ
            "\u103e\u1031\u102c\u101b\u103a": {
            "mm": "o",
            "ipa": "\u0254"
            }, # ကောရ် o, ɔ
            "\u103e\u1031\u102c\u101c\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောလ် aun, aũ
            "\u103e\u1031\u102c\u101d\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဝ် auʼ, auʔ
            "\u103e\u1031\u102c\u101e\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောသ် auʼ, auʔ
            "\u103e\u1031\u102c\u101f\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောဟ် aun, aũ
            #########################
            "\u1031\u102c\u1000\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောက် auʼ, auʔ
            "\u1031\u102c\u1002\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဂ် auʼ, auʔ
            "\u1031\u102c\u1004\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောင်း aun, aũ
            "\u1031\u102c\u1004\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောင့် aun., aũ.
            "\u1031\u102c\u1004\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောင် aun, aũ
            "\u1031\u102c\u1005\u103a": {
            "mm": "o\u02d0s",
            "ipa": "\u0254\u02d0s"
            }, # ကောစ် oːs, ɔːs
            "\u1031\u102c\u1007\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဇ် auʼ, auʔ
            "\u1031\u102c\u1009\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောဉ်း aun, aũ
            "\u1031\u102c\u1009\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောဉ့် aun., aũ.
            "\u1031\u102c\u1009\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောဉ် aun, aũ
            "\u1031\u102c\u100a\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောည်း aunː, aũː
            "\u1031\u102c\u100a\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောည့် aun., aũ.
            "\u1031\u102c\u100a\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောည် aun, aũ
            "\u1031\u102c\u100b\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဋ် auʼ, auʔ
            "\u1031\u102c\u100d\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဍ် auʼ, auʔ
            "\u1031\u102c\u100f\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောဏ်း aunː, aũː
            "\u1031\u102c\u100f\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောဏ့် aun., aũ.
            "\u1031\u102c\u100f\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောဏ် aun, aũ
            "\u1031\u102c\u1010\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောတ် auʼ, auʔ
            "\u1031\u102c\u1012\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဒ် auʼ, auʔ
            "\u1031\u102c\u1014\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောန်း aunː, aũː
            "\u1031\u102c\u1014\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောန့် aun., aũ.
            "\u1031\u102c\u1014\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောန် aun, aũ
            "\u1031\u102c\u1015\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောပ် auʼ, auʔ
            "\u1031\u102c\u1017\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဗ် auʼ, auʔ
            "\u1031\u102c\u1019\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကောမ်း aunː, aũː
            "\u1031\u102c\u1019\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကောမ့် aun., aũ.
            "\u1031\u102c\u1019\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောမ် aun, aũ
            "\u1031\u102c\u101a\u1037\u103a": {
            "mm": "o.",
            "ipa": "\u0254."
            }, # ကောယ့် o., ɔ.
            "\u1031\u102c\u101a\u103a": {"mm": "o", "ipa": "\u0254"}, # ကောယ် o, ɔ
            "\u1031\u102c\u101b\u103a": {"mm": "o", "ipa": "\u0254"}, # ကောရ် o, ɔ
            "\u1031\u102c\u101c\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောလ် aun, aũ
            "\u1031\u102c\u101d\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောဝ် auʼ, auʔ
            "\u1031\u102c\u101e\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကောသ် auʼ, auʔ
            "\u1031\u102c\u101f\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကောဟ် aun, aũ
            #####/
            "\u103e\u1031\u102b\u1000\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ငှေါက် auʼ, auʔ
            "\u103e\u1031\u102b\u1002\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဂ် auʼ, auʔ
            "\u103e\u1031\u102b\u1004\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါင်း aunː, aũː
            "\u103e\u1031\u102b\u1004\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါင့် aun., aũ.
            "\u103e\u1031\u102b\u1004\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါင် aun, aũ
            "\u103e\u1031\u102b\u1005\u103a": {
            "mm": "o\u02d0s",
            "ipa": "\u0254\u02d0s"
            }, # ကေါစ် oːs, ɔːs
            "\u103e\u1031\u102b\u1007\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဇ်, auʼ, auʔ
            "\u103e\u1031\u102b\u1009\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါဉ်း aunː, aũː
            "\u103e\u1031\u102b\u1009\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါဉ့် aun., aũ.
            "\u103e\u1031\u102b\u1009\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါဉ် aun, aũ
            "\u103e\u1031\u102b\u100a\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါည်း aunː, aũː
            "\u103e\u1031\u102b\u100a\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါည့် aun., aũ.
            "\u103e\u1031\u102b\u100a\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါည် aun, aũ
            "\u103e\u1031\u102b\u100b\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဋ် auʼ, auʔ
            "\u103e\u1031\u102b\u100d\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဍ် auʼ, auʔ
            "\u103e\u1031\u102b\u100f\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါဏ်း aunː, aũː
            "\u103e\u1031\u102b\u100f\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါဏ့် aun., aũ.
            "\u103e\u1031\u102b\u100f\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါဏ် aun, aũ
            "\u103e\u1031\u102b\u1010\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါတ် auʼ, auʔ
            "\u103e\u1031\u102b\u1012\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဒ် auʼ, auʔ
            "\u103e\u1031\u102b\u1014\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါန်း aunː, aũː
            "\u103e\u1031\u102b\u1014\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါန့် aun., aũ.
            "\u103e\u1031\u102b\u1014\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါန် aun, aũ
            "\u103e\u1031\u102b\u1015\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါပ် auʼ, auʔ
            "\u103e\u1031\u102b\u1017\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဗ် auʼ, auʔ
            "\u103e\u1031\u102b\u1019\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါမ်း aunː, aũː
            "\u103e\u1031\u102b\u1019\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါမ့် aun., aũ.
            "\u103e\u1031\u102b\u1019\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါမ် aun, aũ
            "\u103e\u1031\u102b\u101a\u1037\u103a": {
            "mm": "o.",
            "ipa": "\u0254."
            }, # ကေါယ့် o., ɔ.
            "\u103e\u1031\u102b\u101a\u103a": {
            "mm": "o",
            "ipa": "\u0254"
            }, # ကေါယ် o, ɔ
            "\u103e\u1031\u102b\u101b\u103a": {
            "mm": "o",
            "ipa": "\u0254"
            }, # ကေါရ် o, ɔ
            "\u103e\u1031\u102b\u101c\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါလ် aun, aũ
            "\u103e\u1031\u102b\u101d\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဝ် auʼ, auʔ
            "\u103e\u1031\u102b\u101e\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါသ် auʼ, auʔ
            "\u103e\u1031\u102b\u101f\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါဟ် aun, aũ
            ######################/
            "\u1031\u102b\u1000\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါက် auʼ, auʔ
            "\u1031\u102b\u1002\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဂ် auʼ, auʔ
            "\u1031\u102b\u1004\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါင်း aun, aũ
            "\u1031\u102b\u1004\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါင့် aun., aũ.
            "\u1031\u102b\u1004\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါင် aun, aũ
            "\u1031\u102b\u1005\u103a": {
            "mm": "o\u02d0s",
            "ipa": "\u0254\u02d0s"
            }, # ကေါစ် oːs, ɔːs
            "\u1031\u102b\u1007\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဇ် auʼ, auʔ
            "\u1031\u102b\u1009\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါဉ်း aun, aũ
            "\u1031\u102b\u1009\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါဉ့် aun., aũ.
            "\u1031\u102b\u1009\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါဉ် aun, aũ
            "\u1031\u102b\u100a\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါည်း aunː, aũː
            "\u1031\u102b\u100a\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါည့် aun., aũ.
            "\u1031\u102b\u100a\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါည် aun, aũ
            "\u1031\u102b\u100b\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဋ် auʼ, auʔ
            "\u1031\u102b\u100d\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဍ် auʼ, auʔ
            "\u1031\u102b\u100f\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါဏ်း aunː, aũː
            "\u1031\u102b\u100f\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါဏ့် aun., aũ.
            "\u1031\u102b\u100f\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါဏ် aun, aũ
            "\u1031\u102b\u1010\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါတ် auʼ, auʔ
            "\u1031\u102b\u1012\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဒ် auʼ, auʔ
            "\u1031\u102b\u1014\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါန်း aunː, aũː
            "\u1031\u102b\u1014\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါန့် aun., aũ.
            "\u1031\u102b\u1014\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါန် aun, aũ
            "\u1031\u102b\u1015\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါပ် auʼ, auʔ
            "\u1031\u102b\u1017\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဗ် auʼ, auʔ
            "\u1031\u102b\u1019\u103a\u1038": {
            "mm": "aun\u02d0",
            "ipa": "au\u0303\u02d0"
            }, # ကေါမ်း aunː, aũː
            "\u1031\u102b\u1019\u1037\u103a": {
            "mm": "aun.",
            "ipa": "au\u0303."
            }, # ကေါမ့် aun., aũ.
            "\u1031\u102b\u1019\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါမ် aun, aũ
            "\u1031\u102b\u101a\u1037\u103a": {
            "mm": "o.",
            "ipa": "\u0254."
            }, # ကေါယ့် o., ɔ.
            "\u1031\u102b\u101a\u103a": {"mm": "o", "ipa": "\u0254"}, # ကေါယ် o, ɔ
            "\u1031\u102b\u101b\u103a": {"mm": "o", "ipa": "\u0254"}, # ကေါရ် o, ɔ
            "\u1031\u102b\u101c\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါလ် aun, aũ
            "\u1031\u102b\u101d\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါဝ် auʼ, auʔ
            "\u1031\u102b\u101e\u103a": {
            "mm": "au\u02bc",
            "ipa": "au\u0294"
            }, # ကေါသ် auʼ, auʔ
            "\u1031\u102b\u101f\u103a": {
            "mm": "aun",
            "ipa": "au\u0303"
            }, # ကေါဟ် aun, aũ
            #######/
            "\u1031\u101e\u103a": {"mm": "i\u02bc", "ipa": "i\u0294"}, # ကေသ် iʼ, iʔ
            #######/
            "\u103e\u1031\u1010\u103a": {
            "mm": "i\u02bc",
            "ipa": "i\u0294"
            }, # ကှေတ် iʼ, iʔ
            #######
            "\u1031\u1010\u103a": {"mm": "i\u02bc", "ipa": "i\u0294"}, # ကေတ် iʼ, iʔ
            ########/
            "\u1031\u100a\u1037\u103a": {"mm": "ei.", "ipa": "e."}, # ကေည့်
            #######
            "\u1031\u100a\u103a": {"mm": "ei", "ipa": "e"}, # ကေည်
            #######/
            "က်ျာ": {"mm": "e\u02bcja", "ipa": "\u025b\u0294ja"}, # က်ယျာ eʼja, ɛʔja
            #######/
            "ှိုက်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိုဂ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိုင်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိုင့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိုင်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိုစ်": {"mm": "ous", "ipa": "os"},
            "ှိုဇ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိုဉ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိုဉ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိုဉ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိုည်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိုည့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိုည်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိုဋ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိုဍ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိုဏ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိုဏ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိုဏ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိုတ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိုဒ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိုန်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိုန့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိုန်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိုပ်": {"mm": "oup", "ipa": "op"},
            "ှိုဗ်": {"mm": "oub", "ipa": "ob"},
            "ှိုမ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိုမ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိုမ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိုယ့်": {"mm": "ou.", "ipa": "o."},
            "ှိုယ်": {"mm": "ou", "ipa": "o"},
            "ှိုရ်": {"mm": "ou", "ipa": "o"},
            "ှိုလ်": {"mm": "ou", "ipa": "o"},
            "ှိုဝ်": {"mm": "ou", "ipa": "o"},
            "ှိုသ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိုဟ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            ######
            "ိုက်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုဂ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုင်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ိုင့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ိုင်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ိုစ်": {"mm": "ous", "ipa": "os"},
            "ိုဇ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုဉ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ိုဉ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ိုဉ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ိုည်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ိုည့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ိုည်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ိုဋ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုဍ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုဏ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ိုဏ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ိုဏ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ိုတ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုဒ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုန်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ိုန့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ိုန်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ိုပ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုဗ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုမ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ိုမ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ိုမ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ိုယ့်": {"mm": "ou.", "ipa": "o."},
            "ိုယ်": {"mm": "ou", "ipa": "o"},
            "ိုရ်": {"mm": "ou", "ipa": "o"},
            "ိုလ်": {"mm": "ou", "ipa": "o"},
            "ိုဝ့်": {"mm": "ou.", "ipa": "o."},
            "ိုဝ်": {"mm": "ou", "ipa": "o"},
            "ိုသ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ိုဟ်": {"mm": "ou", "ipa": "o"},
            #####/
            "ှာက်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှာဂ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှာင်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ှာင့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ှာင်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ှာစ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ှာဇ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ှာဉ်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ှာဉ့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ှာဉ်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ှာည်း": {"mm": "i\u02d0", "ipa": "i\u02d0"}, #iː, iː
            "ှာည့်": {"mm": "i.", "ipa": "i."}, #i., i.
            "ှာည်": {"mm": "i", "ipa": "i"}, #i, i
            "ှာဋ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ှာဍ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ှာဏ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ှာဏ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ှာဏ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှာတ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ှာဒ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ှာန်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ှာန့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ှာန်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှာပ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှာဗ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှာမ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ှာမ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ှာမ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှာယ့်": {"mm": "e.", "ipa": "\u025b."}, #e., ɛ.
            "ှာယ်": {"mm": "e", "ipa": "\u025b"}, #e, ɛ
            "ှာရ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှာလ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှာဝ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှာသ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှာဟ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            ######
            "ာက်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ာဂ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ာင်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ာင့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ာင်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ာစ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ာဇ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ာဉ်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ာဉ့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ာဉ်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ာည်း": {"mm": "i\u02d0", "ipa": "i\u02d0"}, #iː, iː
            "ာည့်": {"mm": "i.", "ipa": "i."}, #i., i.
            "ာည်": {"mm": "i.", "ipa": "i."}, #i, i
            "ာဋ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ာဍ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ာဏ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ာဏ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ာဏ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ာတ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ာဒ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ာန်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ာန့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ာန်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ာပ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ာဗ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ာမ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ာမ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ာမ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ာယ့်": {"mm": "e.", "ipa": "\u025b."}, #e., ɛ.
            "ာယ်": {"mm": "e", "ipa": "\u025b"}, #e, ɛ
            "ာရ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ာလ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ာဝ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ာသ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ာဟ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            ######
            "ါက်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ါဂ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ါင်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ါင့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ါင်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ါစ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ါဇ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ါဉ်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ါဉ့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ါဉ်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ါည်း": {"mm": "i\u02d0", "ipa": "i\u02d0"}, #iː, iː
            "ါည့်": {"mm": "i.", "ipa": "i."}, #i., i.
            "ါည်": {"mm": "i.", "ipa": "i."}, #i, i
            "ါဋ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ါဍ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ါဏ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ါဏ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ါဏ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ါတ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ါဒ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ါန်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ါန့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ါန်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ါပ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ါဗ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ါမ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ါမ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ါမ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ါယ့်": {"mm": "e.", "ipa": "\u025b."}, #e., ɛ.
            "ါယ်": {"mm": "e", "ipa": "\u025b"}, #e, ɛ
            "ါရ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ါလ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ါဝ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ါသ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ါဟ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            #####/
            "ှိက်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိဂ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိင်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိင့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိင်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ
            "ှိစ်": {"mm": "ous", "ipa": "os"}, # ain, aɪ
            "ှိဇ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိဉ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိဉ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိဉ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ
            "ှိည်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိည့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိည်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ
            "ှိဋ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိဍ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိဏ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိဏ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိဏ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိတ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိဒ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိန်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိန့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိန်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိပ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိဗ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိမ်း": {"mm": "ain\u02d0", "ipa": "a\u026a\u0303\u02d0"}, # ainː, aɪ̃ː
            "ှိမ့်": {"mm": "ain.", "ipa": "a\u026a\u0303."}, # ain., aɪ̃.
            "ှိမ်": {"mm": "ain", "ipa": "a\u026a\u0303"}, # ain, aɪ̃
            "ှိယ့်": {"mm": "ou.", "ipa": "o."},
            "ှိယ်": {"mm": "ou", "ipa": "o"},
            "ှိရ်": {"mm": "ou", "ipa": "o"},
            "ှိလ်": {"mm": "ou", "ipa": "o"},
            "ှိဝ့်": {"mm": "ou.", "ipa": "o."},
            "ှိဝ်": {"mm": "ou", "ipa": "o"},
            "ှိသ်": {"mm": "ai\u02bc", "ipa": "a\u026a\u0294"}, # aiʼ, aɪʔ
            "ှိဟ်": {"mm": "ou", "ipa": "o"},
            ######
            "ိက်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိဂ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိင်း": {"mm": "ein\u02d0", "ipa": "e\u026a\u02d0"}, #einː, eɪ̃ː
            "ိင့်": {"mm": "ein.", "ipa": "e\u026a."}, #ein., eɪ̃.
            "ိင်": {"mm": "ein", "ipa": "e\u026a"}, #ein., eɪ̃.
            "ိစ်": {"mm": "i.s", "ipa": "i.s"},
            "ိဇ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိဉ်း": {"mm": "ein\u02d0", "ipa": "e\u026a\u02d0"}, #einː, eɪ̃ː
            "ိဉ့်": {"mm": "ein.", "ipa": "e\u026a."}, #ein., eɪ̃.
            "ိဉ်": {"mm": "ein", "ipa": "e\u026a"}, #ein, eɪ̃
            "ိည်း": {"mm": "ein\u02d0", "ipa": "e\u026a\u02d0"}, #einː, eɪ̃ː
            "ိည့်": {"mm": "ein.", "ipa": "e\u026a."}, #ein., eɪ̃.
            "ိည်": {"mm": "ein", "ipa": "e\u026a"}, #ein, eɪ̃
            "ိဋ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိဍ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိဏ်း": {"mm": "ein\u02d0", "ipa": "e\u026a\u02d0"}, #einː, eɪ̃ː
            "ိဏ့်": {"mm": "ein.", "ipa": "e\u026a."}, #ein., eɪ̃.
            "ိဏ်": {"mm": "ein", "ipa": "e\u026a"}, #ein, eɪ̃
            "ိတ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိဒ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိန်း": {"mm": "ein\u02d0", "ipa": "e\u026a\u02d0"}, #einː, eɪ̃ː
            "ိန့်": {"mm": "ein.", "ipa": "e\u026a."}, #ein., eɪ̃.
            "ိန်": {"mm": "ein", "ipa": "e\u026a"}, #ein, eɪ̃
            "ိပ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိဗ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိမ်း": {"mm": "ein\u02d0", "ipa": "e\u026a\u02d0"}, #einː, eɪ̃ː
            "ိမ့်": {"mm": "ein.", "ipa": "e\u026a."}, #ein., eɪ̃.
            "ိမ်": {"mm": "ein", "ipa": "e\u026a"}, #ein, eɪ̃
            "ိယ့်": {"mm": "i.", "ipa": "i."},
            "ိယ်": {"mm": "i", "ipa": "i"},
            "ိရ်": {"mm": "i", "ipa": "i"},
            "ိလ်": {"mm": "ein", "ipa": "e\u026a"}, #ein, eɪ̃
            "ိဝ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိသ်": {"mm": "ei\u02bc", "ipa": "e\u026a\u0294"}, #eiʼ, eɪʔ
            "ိဟ်": {"mm": "ein", "ipa": "e\u026a"}, #ein, eɪ̃
            #######/
            "ိံ": {"mm": "ein", "ipa": "e\u026a"}, #ein, eɪ̃
            #######
            "ှုက်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုဂ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုင်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ှုင့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ှုင်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ှုစ်": {"mm": "u.s", "ipa": "u.s"},
            "ှုဇ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုဉ်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ှုဉ့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ှုဉ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ှုည်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ှုည့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ှုည်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ှုဋ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုဍ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုဏ်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ှုဏ့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ှုဏ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ှုတ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုဒ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုန်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ှုန့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ှုန်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ှုပ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုဗ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုမ်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ှုမ့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ှုမ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ှုယ့်": {"mm": "ou.", "ipa": "o."}, #ou., o.
            "ှုယ်": {"mm": "ou", "ipa": "o"}, #ou, o
            "ှုရ်": {"mm": "ou", "ipa": "o"}, #ou, o
            "ှုလ်": {"mm": "ou", "ipa": "o"}, #ou, o
            "ှုဝ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုသ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ှုဟ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            ######/
            "ုက်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုဂ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုင်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ုင့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ုင်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ုစ်": {"mm": "u.s", "ipa": "u.s"},
            "ုဇ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုဉ်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ုဉ့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ုဉ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ုည်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ုည့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ုည်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ုဋ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုဍ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုဏ်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ုဏ့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ုဏ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ုတ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုဒ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုန်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ုန့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ုန်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ုပ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုဗ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုမ်း": {"mm": "oun\u02d0", "ipa": "ou\u0303\u02d0"}, #ounː, oũː
            "ုမ့်": {"mm": "oun.", "ipa": "ou\u0303."}, #oun., oũ.
            "ုမ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ုယ့်": {"mm": "u.", "ipa": "u."},
            "ုယ်": {"mm": "u.", "ipa": "u."},
            "ုရ်": {"mm": "u.", "ipa": "u."},
            "ုလ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            "ုဝ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုသ်": {"mm": "ou\u02bc", "ipa": "ou\u0294"}, #ouʼ, ouʔ
            "ုဟ်": {"mm": "oun", "ipa": "ou\u0303"}, #oun, oũ
            #####
            "ှက်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှဂ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှင်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ှင့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ှင်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ှစ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ှဇ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ှဉ်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ှဉ့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ှဉ်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ှည်း": {"mm": "i\u02d0", "ipa": "i\u02d0"}, #iː, iː
            "ှည့်": {"mm": "i.", "ipa": "i."}, #i., i.
            "ှည်": {"mm": "i", "ipa": "i"}, #i, i
            "ှဋ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ှဍ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ှဏ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ှဏ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ှဏ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှတ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ှဒ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ှန်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ှန့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ှန်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှပ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှဗ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှမ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ှမ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ှမ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှယ့်": {"mm": "e.", "ipa": "\u025b."}, #e., ɛ.
            "ှယ်": {"mm": "e", "ipa": "\u025b"}, #e, ɛ
            "ှရ်": {"mm": "e", "ipa": "\u025b"}, #e, ɛ
            "ှလ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ှဝ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှသ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ှဟ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            #####
            "က်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ဂ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "င်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "င့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "င်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "စ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ဇ်": {"mm": "i\u02bc", "ipa": "i\u0294"}, #iʼ, iʔ
            "ဉ်း": {"mm": "in\u02d0", "ipa": "\u026a\u0303\u02d0"}, #inː, ɪ̃ː
            "ဉ့်": {"mm": "in.", "ipa": "\u026a\u0303."}, #in., ɪ̃.
            "ဉ်": {"mm": "in", "ipa": "\u026a\u0303"}, #in, ɪ̃
            "ည်း": {"mm": "i\u02d0", "ipa": "i\u02d0"}, #iː, iː
            "ည့်": {"mm": "i.", "ipa": "i."}, #i., i.
            "ည်": {"mm": "i", "ipa": "i"}, #i, i
            "ဋ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ဍ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ဏ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "ဏ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "ဏ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "တ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "ဒ်": {"mm": "a\u02bc", "ipa": "a\u0294"}, #aʼ, aʔ
            "န်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "န့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "န်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ပ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ဗ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "မ်း": {"mm": "an\u02d0", "ipa": "a\u0303\u02d0"}, #anː, ãː
            "မ့်": {"mm": "an.", "ipa": "a\u0303."}, #an., ã.
            "မ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ယ့်": {"mm": "e.", "ipa": "\u025b."}, #e., ɛ.
            "ယ်": {"mm": "e", "ipa": "\u025b"}, #e, ɛ
            "ရ်": {"mm": "e", "ipa": "\u025b"}, #e, ɛ
            "လ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            "ဝ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "သ်": {"mm": "e\u02bc", "ipa": "\u025b\u0294"}, #eʼ, ɛʔ
            "ဟ်": {"mm": "an", "ipa": "a\u0303"}, #an, ã
            #####/
            "\u1031ရ်": {"mm": "ei", "ipa": "e"},
            #####
            "ွှိူက်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုဂ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုင်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိုင့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိုင်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိုစ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုဇ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုဉ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိုဉ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိုဉ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိုည်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိုည့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိုည်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိုဋ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုဍ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုဏ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိုဏ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိုဏ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိူတ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုဒ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုန်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိုန့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိုန်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိုပ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုဗ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုမ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိုမ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိုမ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိုယ့်": {"mm": "wou.", "ipa": "wo."},
            "ွှိုယ်": {"mm": "wou", "ipa": "wo"},
            "ွှိုရ်": {"mm": "wou", "ipa": "wo"},
            "ွှိုလ်": {"mm": "wou", "ipa": "wo"},
            "ွှိုဝ်": {"mm": "wou", "ipa": "wo"},
            "ွှိုသ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိုဟ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            #####
            "ွိုက်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုဂ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုင်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွိုင့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိုင်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိုစ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုဇ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုဉ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွိုဉ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိုဉ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိုည်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွိုည့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိုည်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိုဋ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုဍ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုဏ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွိုဏ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိုဏ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိုတ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုဒ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုန်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွိုန့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိုန်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိုပ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုဗ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုမ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွိုမ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိုမ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိုယ့်": {"mm": "wou.", "ipa": "wo."},
            "ွိုယ်": {"mm": "wou", "ipa": "wo"},
            "ွိုရ်": {"mm": "wou", "ipa": "wo"},
            "ွိုလ်": {"mm": "wou", "ipa": "wo"},
            "ွိုဝ်": {"mm": "wou", "ipa": "wo"},
            "ွိုသ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိုဟ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            ######/
            "ွှိက်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိဂ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိင်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိင့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိင်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိစ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိဇ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိဉ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိဉ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိဉ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိည်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိည့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိည်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိဋ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိဍ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိဏ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိဏ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိဏ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိတ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိဒ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိန်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိန့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိန်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိပ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိဗ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိမ်း": {
            "mm": "wain\u02d0",
            "ipa": "wa\u026a\u0303\u02d0"
            }, #wainː, waɪ̃ː
            "ွှိမ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွှိမ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိယ့်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိယ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိရ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိလ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွှိဝ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိသ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွှိဟ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            ######/
            "ွိက်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိဂ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိင်း": {"mm": "wain\u02d0", "ipa": "wa\u026a\u0303\u02d0"}, #wainː, waɪ̃ː
            "ွိင့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိင်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိစ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိဇ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိဉ်း": {"mm": "wain\u02d0", "ipa": "wa\u026a\u0303\u02d0"}, #wainː, waɪ̃ː
            "ွိဉ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိဉ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိည်း": {"mm": "wain\u02d0", "ipa": "wa\u026a\u0303\u02d0"}, #wainː, waɪ̃ː
            "ွိည့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိည်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိဋ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိဍ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိဏ်း": {"mm": "wain\u02d0", "ipa": "wa\u026a\u0303\u02d0"}, #wainː, waɪ̃ː
            "ွိဏ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိဏ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိတ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိဒ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိန်း": {"mm": "wain\u02d0", "ipa": "wa\u026a\u0303\u02d0"}, #wainː, waɪ̃ː
            "ွိန့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိန်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိပ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိဗ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိမ်း": {"mm": "wain\u02d0", "ipa": "wa\u026a\u0303\u02d0"}, #wainː, waɪ̃ː
            "ွိမ့်": {"mm": "wain.", "ipa": "wa\u026a\u0303."}, #wain., waɪ̃.
            "ွိမ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိယ့်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိယ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိရ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိလ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            "ွိဝ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိသ်": {"mm": "wa\u02bc", "ipa": "wa\u026a\u0294"}, #waiʼ, waɪʔ
            "ွိဟ်": {"mm": "wain", "ipa": "wa\u026a\u0303"}, #wain, waɪ̃
            ######
            "ွှက်": {"mm": "we\u02bc", "ipa": "w\u025b\u0294"}, #weʼ, wɛʔ
            "ွှဂ်": {"mm": "we\u02bc", "ipa": "w\u025b\u0294"}, #weʼ, wɛʔ
            "ွှင်း": {"mm": "win\u02d0", "ipa": "w\u026a\u0303\u02d0"}, #winː, wɪ̃ː
            "ွှင့်": {"mm": "win.", "ipa": "w\u026a\u0303."}, #win., wɪ̃.
            "ွှင်": {"mm": "win", "ipa": "w\u026a\u0303"}, #win, wɪ̃
            "ွှစ်": {"mm": "wi\u02bc", "ipa": "i\u0294"}, #wiʼ, wiʔ
            "ွှဇ်": {"mm": "wi\u02bc", "ipa": "i\u0294"}, #wiʼ, wiʔ
            "ွှဉ်း": {"mm": "win\u02d0", "ipa": "w\u026a\u0303\u02d0"}, #winː, wɪ̃ː
            "ွှဉ့်": {"mm": "win.", "ipa": "w\u026a\u0303."}, #win., wɪ̃.
            "ွှဉ်": {"mm": "win", "ipa": "w\u026a\u0303"}, #win, wɪ̃
            "ွှည်း": {"mm": "wi\u02d0", "ipa": "wi\u02d0"}, #wiː, wiː
            "ွှည့်": {"mm": "wi.", "ipa": "wi."}, #wi., wi.
            "ွှည်": {"mm": "wi", "ipa": "wi"}, #wi, wi
            "ွှဋ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွှဍ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွှဏ်း": {"mm": "un\u02d0", "ipa": "u\u0303\u02d0"}, #unː, ũː
            "ွှဏ့်": {"mm": "un.", "ipa": "u\u0303."}, #un., ũ.
            "ွှဏ်": {"mm": "un", "ipa": "u\u0303"}, #un, ũ
            "ွှတ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွှဒ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွှန်း": {"mm": "un\u02d0", "ipa": "u\u0303\u02d0"}, #unː, ũː
            "ွှန့်": {"mm": "un.", "ipa": "u\u0303."}, #un., ũ.
            "ွှန်": {"mm": "un", "ipa": "u\u0303"}, #un, ũ
            "ွှပ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွှဗ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွှမ်း": {"mm": "wan\u02d0", "ipa": "wa\u0303\u02d0"}, #wanː, wãː
            "ွှမ့်": {"mm": "wan.", "ipa": "wa\u0303."}, #wan., wã.
            "ွှမ်": {"mm": "wan", "ipa": "wa\u0303"}, #wan, wã
            "ွှယ့်": {"mm": "we.", "ipa": "w\u025b."}, #we., wɛ.
            "ွှယ်": {"mm": "we", "ipa": "w\u025b"}, #we, wɛ
            "ွှရ်": {"mm": "we", "ipa": "w\u025b"}, #we, wɛ
            "ွှလ်": {"mm": "wan", "ipa": "wa\u0303"}, #wan, wã
            "ွှဝ်": {"mm": "wa\u02bc", "ipa": "wa\u0294"}, #waʼ, waʔ
            "ွှသ်": {"mm": "wa\u02bc", "ipa": "wa\u0294"}, #waʼ, waʔ
            "ွှဟ်": {"mm": "wan", "ipa": "wa\u0303"}, #wan, wã
            ######
            "ွက်": {"mm": "we\u02bc", "ipa": "w\u025b\u0294"}, #weʼ, wɛʔ
            "ွဂ်": {"mm": "we\u02bc", "ipa": "w\u025b\u0294"}, #weʼ, wɛʔ
            "ွင်း": {"mm": "win\u02d0", "ipa": "w\u026a\u0303\u02d0"}, #winː, wɪ̃ː
            "ွင့်": {"mm": "win.", "ipa": "w\u026a\u0303."}, #win., wɪ̃.
            "ွင်": {"mm": "win", "ipa": "w\u026a\u0303"}, #win, wɪ̃
            "ွစ်": {"mm": "wi\u02bc", "ipa": "i\u0294"}, #wiʼ, wiʔ
            "ွဇ်": {"mm": "wi\u02bc", "ipa": "i\u0294"}, #wiʼ, wiʔ
            "ွဉ်း": {"mm": "win\u02d0", "ipa": "w\u026a\u0303\u02d0"}, #winː, wɪ̃ː
            "ွဉ့်": {"mm": "win.", "ipa": "w\u026a\u0303."}, #win., wɪ̃.
            "ွဉ်": {"mm": "win", "ipa": "w\u026a\u0303"}, #win, wɪ̃
            "ွည်း": {"mm": "wi\u02d0", "ipa": "wi\u02d0"}, #wiː, wiː
            "ွည့်": {"mm": "wi.", "ipa": "wi."}, #wi., wi.
            "ွည်": {"mm": "wi", "ipa": "wi"}, #wi, wi
            "ွဋ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွဍ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွဏ်း": {"mm": "un\u02d0", "ipa": "u\u0303\u02d0"}, #unː, ũː
            "ွဏ့်": {"mm": "un.", "ipa": "u\u0303."}, #un., ũ.
            "ွဏ်": {"mm": "un", "ipa": "u\u0303"}, #un, ũ
            "ွတ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွဒ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွန်း": {"mm": "un\u02d0", "ipa": "u\u0303\u02d0"}, #unː, ũː
            "ွန့်": {"mm": "un.", "ipa": "u\u0303."}, #un., ũ.
            "ွန်": {"mm": "un", "ipa": "u\u0303"}, #un, ũ
            "ွပ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွဗ်": {"mm": "u\u02bc", "ipa": "u\u0294"}, #uʼ, uʔ
            "ွမ်း": {"mm": "wan\u02d0", "ipa": "wa\u0303\u02d0"}, #wanː, wãː
            "ွမ့်": {"mm": "wan.", "ipa": "wa\u0303."}, #wan., wã.
            "ွမ်": {"mm": "wan", "ipa": "wa\u0303"}, #wan, wã
            "ွယ့်": {"mm": "we.", "ipa": "w\u025b."}, #we., wɛ.
            "ွယ်": {"mm": "we", "ipa": "w\u025b"}, #we, wɛ
            "ွရ်": {"mm": "we", "ipa": "w\u025b"}, #we, wɛ
            "ွလ်": {"mm": "wan", "ipa": "wa\u0303"}, #wan, wã
            "ွဝ်": {"mm": "wa\u02bc", "ipa": "wa\u0294"}, #waʼ, waʔ
            "ွသ်": {"mm": "wa\u02bc", "ipa": "wa\u0294"}, #waʼ, waʔ
            "ွဟ်": {"mm": "wan", "ipa": "wa\u0303"}, #wan, wã
        }

vowelExtendedForm = {
    "ှဲ": {"mm": "eː", "ipa": "ɛː"},
    "ို့": {"mm": "ou.", "ipa": "o."},
    "ှို့": {"mm": "ou.", "ipa": "o."},
    "ိုး": {"mm": "ouː", "ipa": "oː"},
    "ှိုး": {"mm": "ouː", "ipa": "oː"},
    "ော်": {"mm": "o", "ipa": "ɔ"},
    "ှော်": {"mm": "o", "ipa": "ɔ"},
    "ေါ်": {"mm": "o", "ipa": "ɔ"},
    "ှေါ်": {"mm": "o", "ipa": "ɔ"},
    "ော့": {"mm": "o.", "ipa": "ɔ."},
    "ှော့": {"mm": "o.", "ipa": "ɔ."},
    "ေါ့": {"mm": "o.", "ipa": "ɔ."},
    "ှေါ့": {"mm": "o.", "ipa": "ɔ."},
    "ာ့": {"mm": "a.", "ipa": "a."},
    "ှာ့": {"mm": "a.", "ipa": "a."},
    "ါ့": {"mm": "a.", "ipa": "a."},
    "ှါ့": {"mm": "a.", "ipa": "a."},
    "ဲ့": {"mm": "e.", "ipa": "ɛ."},
    "ှဲ့": {"mm": "e.", "ipa": "ɛ."},
    "ှာ": {"mm": "a", "ipa": "a"},
    "ှါ": {"mm": "a", "ipa": "a"},
    "ား": {"mm": "aː", "ipa": "aː"},
    "ှား": {"mm": "aː", "ipa": "aː"},
    "ါး": {"mm": "aː", "ipa": "aː"},
    "ှါး": {"mm": "aː", "ipa": "aː"},
    "ံ့": {"mm": "an.", "ipa": "ã."},
    "ှံ": {"mm": "an", "ipa": "ã"},
    "ှံ့": {"mm": "an.", "ipa": "ã."},
    "ုံး": {"mm": "ounː", "ipa": "oũː"},
    "ှုံး": {"mm": "ounː", "ipa": "oũː"},
    "ုံ့": {"mm": "oun.", "ipa": "oũ."},
    "ှုံ့": {"mm": "oun.", "ipa": "oũ."},
    "ုံ": {"mm": "oun", "ipa": "oũ"},
    "ှုံ": {"mm": "oun", "ipa": "oũ"},
    "ှု": {"mm": "u.", "ipa": "u."},
    "ှူ": {"mm": "u", "ipa": "u"},
    "ှေ": {"mm": "ei", "ipa": "e"},
    "ေ့": {"mm": "ei.", "ipa": "e."},
    "ှေ့": {"mm": "ei.", "ipa": "e."},
    "ေး": {"mm": "eiː", "ipa": "eː"},
    "ှေး": {"mm": "eiː", "ipa": "eː"},
    "ော": {"mm": "oː", "ipa": "ɔː"},
    "ှော": {"mm": "oː", "ipa": "ɔː"},
    "ေါ": {"mm": "oː", "ipa": "ɔː"},
    "ှေါ": {"mm": "oː", "ipa": "ɔː"},
    "ီး": {"mm": "iː", "ipa": "iː"},
    "ှီး": {"mm": "iː", "ipa": "iː"},
    "ှီ": {"mm": "i", "ipa": "i"},
    "ှိ": {"mm": "i.", "ipa": "i."},
    "ူး": {"mm": "uː", "ipa": "uː"},
    "ှူး": {"mm": "uː", "ipa": "uː"},
    "ို": {"mm": "ou", "ipa": "o"},
    "ှို": {"mm": "ou", "ipa": "o"},
}

clusterForm = {
    "ျ": {"mm": "j", "ipa": "j"},
    "ြ": {"mm": "j", "ipa": "j"},
    "ွ": {"mm": "w", "ipa": "w"},
}

shaPhoneme = {
    "sha": {"mm": "sh", "ipa": "ɕ"},
}

kakhagaPintYit = {
    "က": {"mm": "kj", "ipa": "tɕ"},
    "ခ": {"mm": "ch", "ipa": "tɕʰ"},
    "ဂ": {"mm": "gj", "ipa": "dʒ"},
}

haPhoneme = {
    "ဟ": {"mm": "h", "ipa": "ɦ"},
}

thaPhoneme = {
    "သှ": {"mm": "dh", "ipa": "ð"},
}

yayaSilent = {
    "ရ": {"mm": "", "ipa": ""},
    "ယ": {"mm": "", "ipa": ""},
}

modifyForm = {
    "ရ": {"mm": "sh", "ipa": "ɕ"},
    "ယ": {"mm": "sh", "ipa": "ɕ"},
    "သ": {"mm": "dh", "ipa": "ð"},
    "ဟ": {"mm": "h", "ipa": "ɦ"},
}

def transcript(text: str, phoneme_key: str, syllable_list: list, mono_is_last: bool) -> str:
    output = []
    i = 0

    while i < len(text):
        char = text[i]
        next_char = text[i + 1] if i + 1 < len(text) else ""
        after_next = text[i + 2] if i + 2 < len(text) else ""
        third_next = text[i + 3] if i + 3 < len(text) else ""
        
        # All but first singleton
        all_but_s = text[1:] if len(text) > 1 else ""
        # All but first singleton + cluster
        all_but_sc = text[2:] if len(text) > 2 else ""
        # All but first singleton + cluster + cluster
        all_but_scc = text[3:] if len(text) > 3 else ""

        if (
            char in singleton
            and next_char in clusterForm
            and after_next in clusterForm
            and all_but_scc in asatExtendedForm
        ):
            if third_next == "ှ":
                # သျွှင်း
                if next_char in ["ျ", "ြ"] and char in ["ရ", "ယ", "သ", "လ"]:
                    output.append(
                        f"{shaPhoneme['sha'][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ကျွှင်း
                elif next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{vowelForm[third_next][phoneme_key]}{kakhagaPintYit[char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ဟျွှင်း
                elif char == "ဟ":
                    output.append(
                        f"{haPhoneme['ဟ'][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{asatExtendedForm[all_but_scc][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{vowelForm[third_next][phoneme_key]}{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{asatExtendedForm[all_but_scc][phoneme_key]}"
                    )
            else:
                # ကျွား
                if next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{kakhagaPintYit[char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ယျွား
                elif next_char in ["ျ", "ြ"] and char in yayaSilent:
                    output.append(
                        f"{yayaSilent[char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{asatExtendedForm[all_but_scc][phoneme_key]}"
                    )

            i += 3 + len(all_but_scc)
            print("rule 4.2: Singleton + Cluster + Cluster + AsatExtendedForm")
        # Rule 4.1: Singleton + Cluster + AsatExtendedForm
        elif (
            char in singleton
            and next_char in clusterForm
            and all_but_sc in asatExtendedForm
        ):
            if after_next == "ှ":
                # ယျှင်
                if next_char in ["ျ", "ြ"] and char in ["ရ", "ယ", "သ", "လ"]:
                    output.append(
                        f"{shaPhoneme['sha'][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ကျှ, ချှ, ဂျှ
                elif next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{vowelForm[after_next][phoneme_key]}{kakhagaPintYit[char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ဟျှက်, ဟွှက်
                elif char == "ဟ":
                    output.append(
                        f"{haPhoneme['ဟ'][phoneme_key]}{clusterForm[next_char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ရွှ, ယွှ
                elif next_char == "ွ" and char in ["ရ", "ယ"]:
                    output.append(
                        f"{shaPhoneme['sha'][phoneme_key]}{asatExtendedForm[all_but_s][phoneme_key]}"
                    )
                # သွှ
                elif next_char == "ွ" and char == "သ":
                    output.append(
                        f"{vowelForm[after_next][phoneme_key]}{thaPhoneme['သှ'][phoneme_key]}{asatExtendedForm[all_but_s][phoneme_key]}"
                    )
                elif next_char == "ွ":
                    output.append(
                        f"{vowelForm[after_next][phoneme_key]}{singleton[char][phoneme_key]}{asatExtendedForm[all_but_s][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{vowelForm[after_next][phoneme_key]}{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                i += 3 + len(all_but_sc)
            else:
                # ကျ, ချ, ဂျ
                if next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{kakhagaPintYit[char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ရျ, ယျ
                elif next_char in ["ျ", "ြ"] and char in yayaSilent:
                    output.append(
                        f"{yayaSilent[char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                elif next_char == "ွ":
                    output.append(
                        f"{singleton[char][phoneme_key]}{asatExtendedForm[all_but_s][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{asatExtendedForm[all_but_sc][phoneme_key]}"
                    )
                i += 2 + len(all_but_sc)

            print("rule 4.1: Singleton + Cluster + AsatExtendedForm")
        # Rule 4.0: Singleton + AsatExtendedForm
        elif char in singleton and all_but_s in asatExtendedForm:
            if next_char == "ှ":
                if char in modifyForm:
                    output.append(
                        f"{modifyForm[char][phoneme_key]}{asatExtendedForm[all_but_s][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{vowelForm[next_char][phoneme_key]}{singleton[char][phoneme_key]}{asatExtendedForm[all_but_s][phoneme_key]}"
                    )
                i += 2 + len(all_but_s)
            else:
                output.append(
                    f"{singleton[char][phoneme_key]}{asatExtendedForm[all_but_s][phoneme_key]}"
                )
                i += 1 + len(all_but_s)
            
            print('rule 4.0: Singleton + AsatExtendedForm')
# Rule 3.1: Singleton + Cluster + Cluster + Vowel Extended
        elif (
            char in singleton
            and next_char in clusterForm
            and after_next in clusterForm
            and all_but_scc in vowelExtendedForm
        ):
            if third_next == "ှ":
                # သျွှား
                if next_char in ["ျ", "ြ"] and char in ["ရ", "ယ", "သ", "လ"]:
                    output.append(
                        f"{shaPhoneme['sha'][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelExtendedForm[all_but_scc][phoneme_key]}"
                    )
                # ကျွှား
                elif next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{vowelForm[third_next][phoneme_key]}{kakhagaPintYit[char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelExtendedForm[all_but_scc][phoneme_key]}"
                    )
                # ဟျွှား
                elif char == "ဟ":
                    output.append(
                        f"{haPhoneme['ဟ'][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelExtendedForm[all_but_scc][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{vowelForm[third_next][phoneme_key]}{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelExtendedForm[all_but_scc][phoneme_key]}"
                    )
                i += 3 + len(all_but_scc)
            else:
                # ကျွား
                if next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{kakhagaPintYit[char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelExtendedForm[all_but_scc][phoneme_key]}"
                    )
                # ယျွား
                elif next_char in ["ျ", "ြ"] and char in yayaSilent:
                    output.append(
                        f"{yayaSilent[char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelExtendedForm[all_but_scc][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelExtendedForm[all_but_scc][phoneme_key]}"
                    )
                i += 3 + len(all_but_scc)
            
            print("rule 3.1: Singleton + Cluster + Cluster + Extended")

# Rule 3.0: Singleton + Cluster + Cluster + Vowel
        elif (
            char in singleton
            and next_char in clusterForm
            and after_next in clusterForm
        ):
            if third_next in vowelForm:
                if third_next == "ှ":
                    # သျွှ
                    if next_char in ["ျ", "ြ"] and char in ["ရ", "ယ", "သ", "လ"]:
                        output.append(
                            f"{shaPhoneme['sha'][phoneme_key]}{clusterForm[after_next][phoneme_key]}a."
                        )
                    # ကျွှ
                    elif next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                        output.append(
                            f"{vowelForm[third_next][phoneme_key]}{kakhagaPintYit[char][phoneme_key]}{clusterForm[after_next][phoneme_key]}a."
                        )
                    # ဟျွှ
                    elif char == "ဟ":
                        output.append(
                            f"{haPhoneme['ဟ'][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}a."
                        )
                    # ယျွှ
                    elif next_char == "ွ" and char in ["ရ", "ယ"]:
                        output.append(
                            f"{shaPhoneme['sha'][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                        )
                    else:
                        output.append(
                            f"{vowelForm[third_next][phoneme_key]}{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}a."
                        )
                else:
                    # ကျွား ကြွား
                    if next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                        output.append(
                            f"{kakhagaPintYit[char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelForm[third_next][phoneme_key]}"
                        )
                    # ယျွား
                    elif next_char in ["ျ", "ြ"] and char in yayaSilent:
                        output.append(
                            f"{yayaSilent[char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelForm[third_next][phoneme_key]}"
                        )
                    else:
                        output.append(
                            f"{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}{vowelForm[third_next][phoneme_key]}"
                        )
                i += 4
            else:
                # ကျွ
                if next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{kakhagaPintYit[char][phoneme_key]}{clusterForm[after_next][phoneme_key]}a."
                    )
                # ယျွ
                elif next_char in ["ျ", "ြ"] and char in yayaSilent:
                    output.append(
                        f"{yayaSilent[char][phoneme_key]}{clusterForm[after_next][phoneme_key]}a."
                    )
                else:
                    output.append(
                        f"{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{clusterForm[after_next][phoneme_key]}a."
                    )
                i += 3
            
            print('rule 3.0: Singleton + Cluster + Cluster + Vowel')

# Rule 2.1: Singleton + Cluster + Vowel Extended
        elif (
            char in singleton
            and next_char in clusterForm
            and all_but_sc in vowelExtendedForm
        ):
            if after_next == "ှ":
                # ရျှား, ယျှား, သျှား, လျှား
                if next_char in ["ျ", "ြ"] and char in ["ရ", "ယ", "သ", "လ"]:
                    output.append(
                        f"{shaPhoneme['sha'][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ကျှ, ချှ, ဂျှ
                elif next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{vowelForm[after_next][phoneme_key]}{kakhagaPintYit[char][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ဟျှ, ဟွှ
                elif char == "ဟ":
                    output.append(
                        f"{haPhoneme['ဟ'][phoneme_key]}{clusterForm[next_char][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ရွှ, ယွှ
                elif next_char == "ွ" and char in ["ရ", "ယ"]:
                    output.append(
                        f"{shaPhoneme['sha'][phoneme_key]}{clusterForm[next_char][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # သွှ
                elif next_char == "ွ" and char == "သ":
                    output.append(
                        f"{vowelForm[after_next][phoneme_key]}{thaPhoneme['သှ'][phoneme_key]}{clusterForm[next_char][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{vowelForm[after_next][phoneme_key]}{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                i += 2 + len(all_but_sc)
            else:
                # ကျ, ချ, ဂျ
                if next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(
                        f"{kakhagaPintYit[char][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                # ရျ, ယျ
                elif next_char in ["ျ", "ြ"] and char in yayaSilent:
                    output.append(
                        f"{yayaSilent[char][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{vowelExtendedForm[all_but_sc][phoneme_key]}"
                    )
                i += 2 + len(all_but_sc)

            print("rule 2.1: Singleton + Cluster + Vowel Extended")

        # Rule 2.0: Singleton + Cluster + Vowel
        elif char in singleton and next_char in clusterForm:
            if after_next in vowelForm:
                if after_next == "ှ":
                    # ရျှ, ယျှ, သျှ, လျှ
                    if next_char in ["ျ", "ြ"] and char in ["ရ", "ယ", "သ", "လ"]:
                        output.append(f"{shaPhoneme['sha'][phoneme_key]}a.")
                    # ကျှ, ချှ, ဂျှ
                    elif next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                        output.append(
                            f"{vowelForm[after_next][phoneme_key]}{kakhagaPintYit[char][phoneme_key]}a."
                        )
                    # ဟျှ, ဟွှ
                    elif char == "ဟ":
                        output.append(
                            f"{haPhoneme['ဟ'][phoneme_key]}{clusterForm[next_char][phoneme_key]}a."
                        )
                    # ရွှ, ယွှ
                    elif next_char == "ွ" and char in ["ရ", "ယ"]:
                        output.append(
                            f"{shaPhoneme['sha'][phoneme_key]}{clusterForm[next_char][phoneme_key]}a."
                        )
                    # သွှ
                    elif next_char == "ွ" and char == "သ":
                        output.append(
                            f"{vowelForm[after_next][phoneme_key]}{thaPhoneme['သှ'][phoneme_key]}{clusterForm[next_char][phoneme_key]}a."
                        )
                    else:
                        output.append(
                            f"{vowelForm[after_next][phoneme_key]}{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}a."
                        )
                else:
                    # ကျ, ချ, ဂျ
                    if next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                        output.append(
                            f"{kakhagaPintYit[char][phoneme_key]}{vowelForm[after_next][phoneme_key]}"
                        )
                    # ရျ, ယျ
                    elif next_char in ["ျ", "ြ"] and char in yayaSilent:
                        output.append(
                            f"{yayaSilent[char][phoneme_key]}{vowelForm[after_next][phoneme_key]}"
                        )
                    else:
                        output.append(
                            f"{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}{vowelForm[after_next][phoneme_key]}"
                        )
                i += 3
            else:
                # ကျ, ချ, ဂျ
                if next_char in ["ျ", "ြ"] and char in kakhagaPintYit:
                    output.append(f"{kakhagaPintYit[char][phoneme_key]}a.")
                # ရျ, ယျ
                elif next_char in ["ျ", "ြ"] and char in yayaSilent:
                    output.append(f"{yayaSilent[char][phoneme_key]}a.")
                else:
                    output.append(
                        f"{singleton[char][phoneme_key]}{clusterForm[next_char][phoneme_key]}a."
                    )
                i += 2
            
            print("rule 2.0: Singleton + Cluster + Vowel")

# -------------------------------------------------------------------------------------------------------------------------------------------------------------

        # Rule 1.1: Singleton + Vowel Extended Forms
        elif char in singleton and all_but_s in vowelExtendedForm:
            if next_char == "ှ":
                if char in modifyForm:
                    output.append(
                        f"{modifyForm[char][phoneme_key]}{vowelExtendedForm[all_but_s][phoneme_key]}"
                    )
                else:
                    output.append(
                        f"{vowelForm[next_char][phoneme_key]}{singleton[char][phoneme_key]}{vowelExtendedForm[all_but_s][phoneme_key]}"
                    )
                i += 1 + len(all_but_s)
            else:
                output.append(
                    f"{singleton[char][phoneme_key]}{vowelExtendedForm[all_but_s][phoneme_key]}"
                )
                i += 1 + len(all_but_s)
            
            print("rule 1.1: Singleton + Vowel Extended Forms")


        # Rule 1.0: Singleton + Vowel (base)
        elif char in singleton:
            if next_char in vowelForm:
                if next_char == "ှ":
                    if char in modifyForm:
                        output.append(f"{modifyForm[char][phoneme_key]}a.")
                    else:
                        output.append(f"{vowelForm[next_char][phoneme_key]}{singleton[char][phoneme_key]}a.")
                else:
                    output.append(f"{singleton[char][phoneme_key]}{vowelForm[next_char][phoneme_key]}")
                i += 2
            else:
                if syllable_list and syllable_list[-1] == char:
                    if char == "အ":
                        output.append("a.")
                    else:
                        output.append(f"{singleton[char][phoneme_key]}a.")
                else:
                    if char == "အ":
                        output.append("a̠")
                    else:
                        output.append(f"{singleton[char][phoneme_key]}ə")
                i += 1
            
            print("rule 1.0: Singleton + Vowel (base)")

# -------------------------------------------------------------------------------------------------------------------------------------------------------------

        # Rule 0.1: Special Character Form
        elif char in specialCharsForm:
            output.append(specialCharsForm[char][phoneme_key])
            i += 1
            print("rule 0.1: Special Character Form")

        # -------------------------------------------------------------------------------------------------------------------------------------------------------------

        # Rule 0.0: Default - just append
        else:
            output.append(char)
            i += 1
            print("rule 0.0: Default")

    return "".join(output)








